import React from 'react';
import styles from './postcontent.css';
import { Text } from '../../Text';
import { Image } from '../../Image';
import { EColor } from '../../../enum';

export function PostContent() {
  return (
    <>
      <Text As={'p'} size={14} color={EColor.black} lineHeightPercent={171}>
        Есть над чем задуматься: тщательные исследования конкурентов представляют собой не&nbsp;что
        иное, как квинтэссенцию победы маркетинга над разумом и&nbsp;должны быть ассоциативно
        распределены по&nbsp;отраслям. Прежде всего, начало повседневной работы по&nbsp;формированию
        позиции однозначно фиксирует необходимость кластеризации усилий. Но&nbsp;сторонники
        тоталитаризма в&nbsp;науке и&nbsp;по&nbsp;сей день остаются уделом либералов, которые жаждут
        быть превращены в&nbsp;посмешище, хотя само их&nbsp;существование приносит несомненную
        пользу обществу.
      </Text>
      <Image
        src='https://i.pinimg.com/1200x/27/8e/a8/278ea85ceebe2dd36f8f0f37ac25a2bf.jpg'
        alt='Лес'
        width={840}
        height={495}>
        Учитывая ключевые сценарии поведения, социально-экономическое развитие играет определяющее
        значение.
      </Image>
      <Text As={'p'} size={14} color={EColor.black} lineHeightPercent={171}>
        Безусловно, глубокий уровень погружения создаёт необходимость включения
        в&nbsp;производственный план целого ряда внеочередных мероприятий с&nbsp;учётом комплекса
        системы массового участия. Внезапно, сделанные на&nbsp;базе интернет-аналитики выводы
        освещают чрезвычайно интересные особенности картины в&nbsp;целом, однако конкретные выводы,
        разумеется, описаны максимально подробно.
      </Text>
      <Image
        src='https://i.pinimg.com/1200x/e8/e7/68/e8e768ef0c3803d7deabb88353ee8f4c.jpg'
        alt='Мост'
        width={410}
        height={300}>
        Господа, высококачественный прототип будущего проекта играет определяющее значение для как
        самодостаточных, так и&nbsp;внешне зависимых концептуальных решений.
      </Image>
      <Image
        src='https://i.pinimg.com/1200x/bc/57/1d/bc571d63908c85a4da10acb7686277cc.jpg'
        alt='Люди в городе'
        width={410}
        height={300}>
        Принимая во&nbsp;внимание показатели успешности, разбор внешних противодействий обеспечивает
        актуальность форм воздействия.
      </Image>
      <Text As={'p'} size={14} color={EColor.black} lineHeightPercent={171}>
        Разнообразный и&nbsp;богатый опыт говорит нам, что выбранный нами инновационный путь
        обеспечивает широкому кругу (специалистов) участие в&nbsp;формировании новых принципов
        формирования материально-технической и&nbsp;кадровой базы. Также как существующая теория
        в&nbsp;значительной степени обусловливает важность благоприятных перспектив. Для
        современного мира консультация с&nbsp;широким активом однозначно определяет каждого
        участника как способного принимать собственные решения касаемо приоритизации разума над
        эмоциями!
      </Text>
      <Image
        src='https://i.pinimg.com/736x/60/d4/2a/60d42a8141e4be6fd17ec0d325687795.jpg'
        alt='Скафандер в лесу'
        width={267}
        height={195}>
        Таким образом, разбавленное изрядной долей эмпатии, рациональное мышление играет важную
        роль.
      </Image>
      <Image
        src='https://i.pinimg.com/1200x/7c/16/db/7c16db0f5f5232d63d9e187d4c05c993.jpg'
        alt='Дорога в закат'
        width={267}
        height={195}>
        Не&nbsp;следует, однако, забывать, что глубокий уровень способствует.
      </Image>
      <Image
        src='https://i.pinimg.com/1200x/c4/4d/b7/c44db751dda9877e2ca7a7d72c292a04.jpg'
        alt='Автомобиль'
        width={267}
        height={195}>
        Но&nbsp;сторонники тоталитаризма в&nbsp;науке, инициированные исключительно.
      </Image>
      <Text As={'p'} size={14} color={EColor.black} lineHeightPercent={171}>
        Вот вам яркий пример современных тенденций&nbsp;&mdash; постоянный количественный рост
        и&nbsp;сфера нашей активности обеспечивает актуальность глубокомысленных рассуждений!
        Не&nbsp;следует, однако, забывать, что высококачественный прототип будущего проекта
        предполагает независимые способы реализации дальнейших направлений развития.
      </Text>
      <Image
        src='https://i.pinimg.com/1200x/dc/05/25/dc0525784aad853af48b2c7b7140d81a.jpg'
        alt='Кошки в очках'
        width={410}
        height={300}>
        Значимость этих проблем настолько очевидна, что разбавленное изрядной долей эмпатии,
        рациональное мышление говорит о&nbsp;возможностях вывода текущих активов.
      </Image>
      <Image
        src='https://i.pinimg.com/736x/93/dd/99/93dd99fbaff66ef0dcada7402bf86d7b.jpg'
        alt='Путин, Трамп с игрушкой Винни Пух в руках и Ким Чен Ин смотрят в дверной глазок'
        width={410}
        height={300}>
        Господа, понимание сути ресурсосберегающих технологий обеспечивает актуальность новых
        принципов формирования материально-технической и&nbsp;кадровой базы!
      </Image>
    </>
  );
}
