import React, { useEffect, useRef } from 'react';
import styles from './post.css';
import ReactDOM from 'react-dom';
import { CommentForm } from '../CommentForm';

interface IPostsProps {
  onClose?: () => void;
}

export function Post(props: IPostsProps) {
  const postRef = useRef<HTMLDivElement>(null);

  useEffect(() => {
    function handleClick(event: MouseEvent) {
      if (event.target instanceof Node && !postRef.current?.contains(event.target)) {
        props.onClose?.();
      }
    }

    document.addEventListener('click', handleClick);

    return () => document.removeEventListener('click', handleClick);
  }, []);

  const modalNode = document.querySelector('#modal_root');
  if (!modalNode) return null;

  return ReactDOM.createPortal(
    <div className={styles.modal} ref={postRef}>
      <h2>Следует отметить, что новая модель организационной деятельности поможет</h2>
      <div className={styles.content}>
        <p>
          Есть над чем задуматься: тщательные исследования конкурентов представляют собой не что
          иное, как квинтэссенцию победы маркетинга над разумом и должны быть ассоциативно
          распределены по отраслям. Прежде всего, начало повседневной работы по формированию позиции
          однозначно фиксирует необходимость кластеризации усилий. Но сторонники тоталитаризма в
          науке и по сей день остаются уделом либералов, которые жаждут быть превращены в посмешище,
          хотя само их существование приносит несомненную пользу обществу.
        </p>
        <p>
          Есть над чем задуматься: тщательные исследования конкурентов представляют собой не что
          иное, как квинтэссенцию победы маркетинга над разумом и должны быть ассоциативно
          распределены по отраслям. Прежде всего, начало повседневной работы по формированию позиции
          однозначно фиксирует необходимость кластеризации усилий. Но сторонники тоталитаризма в
          науке и по сей день остаются уделом либералов, которые жаждут быть превращены в посмешище,
          хотя само их существование приносит несомненную пользу обществу.
        </p>
        <p>
          Есть над чем задуматься: тщательные исследования конкурентов представляют собой не что
          иное, как квинтэссенцию победы маркетинга над разумом и должны быть ассоциативно
          распределены по отраслям. Прежде всего, начало повседневной работы по формированию позиции
          однозначно фиксирует необходимость кластеризации усилий. Но сторонники тоталитаризма в
          науке и по сей день остаются уделом либералов, которые жаждут быть превращены в посмешище,
          хотя само их существование приносит несомненную пользу обществу.
        </p>
      </div>
      <CommentForm />
    </div>,
    modalNode,
  );
}
